;;; Package --- Summary
;;; Commentary:
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
;;; Code:

(package! crux)
(package! rotate)
(package! easy-kill)
(package! smart-region)
(package! avy-zap)
(package! iedit)
(package! fanyi)
(package! ialign)
(package! ctrlf)
(package! just-mode)
(package! deadgrep)
(package! indent-bars)
(package! goto-last-change)
(package! dired-git-info)
(package! powershell)
;; :recipe (:host github :repo "camdez/goto-last-change"))
